## Jeopardy

In [1]:
# dependencies
import random
import pandas as pd
import requests
import json
import numpy as np
import glob
import json
import csv
import os

In [2]:
# read in jeopardy.csv1
file_jeo1 = "resources/jeopardy_1.csv"
data_jeo1 = pd.read_csv(file_jeo1,index_col=None, header=0)
data_jeo1.head(2)

,gid,airdate,rnd,category,text,answer,value
0,346,1983-09-18,1,WORLD GEOGRAPHY,"This country's counties include Kerry, Kilken...",Ireland,25
1,346,1983-09-18,1,BEST-SELLERS,This Jacqueline Susann novel is the all-time ...,Valley of the Dolls,25

In [3]:
data_jeo1 = data_jeo1.rename(columns={"text":"Question", "answer": "Answer", "value": "Value", "category":"Category", 
                                      "airdate":"Air_Date"})
data_jeo1.columns
data_jeo1.head(2)

,gid,Air_Date,rnd,Category,Question,Answer,Value
0,346,1983-09-18,1,WORLD GEOGRAPHY,"This country's counties include Kerry, Kilken...",Ireland,25
1,346,1983-09-18,1,BEST-SELLERS,This Jacqueline Susann novel is the all-time ...,Valley of the Dolls,25

In [4]:
data_jeo1 = data_jeo1[['gid', 'Air_Date', 'rnd', 'Category', 'Value', 'Question', 'Answer']]
data_jeo1.head(2)

,gid,Air_Date,rnd,Category,Value,Question,Answer
0,346,1983-09-18,1,WORLD GEOGRAPHY,25,"This country's counties include Kerry, Kilken...",Ireland
1,346,1983-09-18,1,BEST-SELLERS,25,This Jacqueline Susann novel is the all-time ...,Valley of the Dolls

In [5]:
# read in jeopardy.csv2 cp1252
data_jeo2 = pd.read_csv("resources/jeopardy_2.csv" , encoding="ISO-8859-1")
data_jeo2.columns

Index(['Show_Number', 'Air_Date', 'Round', 'Category', ' Value ', 'Question',
       'Answer'],
      dtype='object')

In [6]:
# merge tables
complete_jeopardy = pd.merge(data_jeo1, data_jeo2, on="Question", how="left")
complete_jeopardy.head(2)

,gid,Air_Date_x,rnd,Category_x,Value,Question,Answer_x,Show_Number,Air_Date_y,Round,Category_y,Value,Answer_y
0,346,1983-09-18,1,WORLD GEOGRAPHY,25,"This country's counties include Kerry, Kilken...",Ireland,NaN,NaN,NaN,NaN,NaN,NaN
1,346,1983-09-18,1,BEST-SELLERS,25,This Jacqueline Susann novel is the all-time ...,Valley of the Dolls,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
complete_jeopardy.columns

Index(['gid', 'Air_Date_x', 'rnd', 'Category_x', 'Value', 'Question',
       'Answer_x', 'Show_Number', 'Air_Date_y', 'Round', 'Category_y',
       ' Value ', 'Answer_y'],
      dtype='object')

In [8]:
complete_jeopardy = complete_jeopardy.rename(columns={'gid': 'Game_ID', 'Air_Date_x': "Air_Date", 'rnd': "Rnd", 
                                                     'Category_x': "Category", 'Value': 'Dollar_Value', 'Question': 'Question', 
                                                      'Answer_x':'Answer', 'Show_Number': 'Show_Number', 
                                                      'Round':'Jeopardy_Double'})
complete_jeopardy.head(2)

,Game_ID,Air_Date,Rnd,Category,Dollar_Value,Question,Answer,Show_Number,Air_Date_y,Jeopardy_Double,Category_y,Value,Answer_y
0,346,1983-09-18,1,WORLD GEOGRAPHY,25,"This country's counties include Kerry, Kilken...",Ireland,NaN,NaN,NaN,NaN,NaN,NaN
1,346,1983-09-18,1,BEST-SELLERS,25,This Jacqueline Susann novel is the all-time ...,Valley of the Dolls,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
complete_jeopardy.columns

Index(['Game_ID', 'Air_Date', 'Rnd', 'Category', 'Dollar_Value', 'Question',
       'Answer', 'Show_Number', 'Air_Date_y', 'Jeopardy_Double', 'Category_y',
       ' Value ', 'Answer_y'],
      dtype='object')

In [10]:
complete_jeopardy = complete_jeopardy[['Game_ID', 'Jeopardy_Double','Rnd', 'Air_Date','Category', 'Dollar_Value', 
                                       'Question', 'Answer']]
complete_jeopardy.head(2)

,Game_ID,Jeopardy_Double,Rnd,Air_Date,Category,Dollar_Value,Question,Answer
0,346,NaN,1,1983-09-18,WORLD GEOGRAPHY,25,"This country's counties include Kerry, Kilken...",Ireland
1,346,NaN,1,1983-09-18,BEST-SELLERS,25,This Jacqueline Susann novel is the all-time ...,Valley of the Dolls

In [11]:
complete_jeopardy['Year'] = complete_jeopardy['Air_Date'].str[:5]
complete_jeopardy.fillna(0, inplace=True)
complete_jeopardy.head()

,Game_ID,Jeopardy_Double,Rnd,Air_Date,Category,Dollar_Value,Question,Answer,Year
0,346,0,1,1983-09-18,WORLD GEOGRAPHY,25,"This country's counties include Kerry, Kilken...",Ireland,1983
1,346,0,1,1983-09-18,BEST-SELLERS,25,This Jacqueline Susann novel is the all-time ...,Valley of the Dolls,1983
2,346,0,1,1983-09-18,SPORTS,25,He's won 5 of the 10 last U.S. Open tennis ti...,Jimmy Connors,1983
3,346,0,1,1983-09-18,LISTS,25,Moses received this list on Mt. Sinai,the Ten Commandments,1983
4,346,0,1,1983-09-18,WILD WEST,25,This was William Bonney's best-known alias,Billy the Kid,1983

In [12]:
complete_jeopardy.index.rename('question_id', inplace=True)
complete_jeopardy['Question'] = complete_jeopardy['Question'].str.strip()
complete_jeopardy.head()

,Game_ID,Jeopardy_Double,Rnd,Air_Date,Category,Dollar_Value,Question,Answer,Year
question_id,,,,,,,,,
0,346,0,1,1983-09-18,WORLD GEOGRAPHY,25,"This country's counties include Kerry, Kilkenn...",Ireland,1983
1,346,0,1,1983-09-18,BEST-SELLERS,25,This Jacqueline Susann novel is the all-time f...,Valley of the Dolls,1983
2,346,0,1,1983-09-18,SPORTS,25,He's won 5 of the 10 last U.S. Open tennis titles,Jimmy Connors,1983
3,346,0,1,1983-09-18,LISTS,25,Moses received this list on Mt. Sinai,the Ten Commandments,1983
4,346,0,1,1983-09-18,WILD WEST,25,This was William Bonney's best-known alias,Billy the Kid,1983

In [13]:
complete_jeopardy.loc[1092][6]

"It forms a large part of Jupiter's atmosphere or Earth's kitchen cleaners"

In [14]:
complete_jeopardy['Answer'].value_counts().head()

 Australia    335
 China        330
 France       316
 Chicago      316
 Japan        310
Name: Answer, dtype: int64

In [15]:
complete_jeopardy.columns

Index(['Game_ID', 'Jeopardy_Double', 'Rnd', 'Air_Date', 'Category',
       'Dollar_Value', 'Question', 'Answer', 'Year'],
      dtype='object')

In [16]:
complete_jeopardy.to_csv("data/complete_jeopardy.csv", index=False)

In [17]:
complete_jeopardy.describe()

             Game_ID            Rnd   Dollar_Value
count  357148.000000  357148.000000  357148.000000
mean     3050.272878       1.522668     766.118337
std      1754.006946       0.532143     656.842878
min         1.000000       1.000000       0.000000
25%      1538.000000       1.000000     400.000000
50%      3041.000000       2.000000     600.000000
75%      4569.000000       2.000000    1000.000000
max      6095.000000       3.000000   19000.000000

In [18]:
jeopardy_unique = complete_jeopardy["Category"].nunique()
jeopardy_unique

42596

In [19]:
jeopardy_category = complete_jeopardy.groupby('Category')['Year'].count()
jeopardy_category.head()

Category
  A JIM CARREY FILM FESTIVAL     5
 "!"                             5
 "&" MAGAZINES                   3
 "'YS" WORDS                     5
 "-ARES"                         5
Name: Year, dtype: int64

In [21]:
jeopardy_category = complete_jeopardy.groupby('Year')['Category'].count()
jeopardy_category.head()

Year
 1983      53
 1984    1745
 1985    2167
 1986    3580
 1987    6811
Name: Category, dtype: int64

## Facial Hair

In [22]:
hair_file = pd.read_csv("resources/university-graduate-facial-hair-styles_2.csv" , encoding="ISO-8859-1")
facial_hair = pd.DataFrame(hair_file)
facial_hair.index.rename('hair_id', inplace=True)
facial_hair.head()

,Year,Cleanshaven,Full Beard/Chinstrap,Goatee,Moustache,Moustache (with Muttonchops),Moustache (with Sideburns),Muttonchops,Sideburns
hair_id,,,,,,,,,
0,2008,127,20,11,1,0,0,1,43
1,2007,227,25,21,0,0,0,10,89
2,2006,236,18,26,1,0,0,6,66
3,2005,325,17,34,1,0,0,5,110
4,2004,353,17,61,1,0,0,6,91

In [23]:
facial_hair = facial_hair.rename(columns={'Year' : 'Year', 'Cleanshaven' : 'Cleanshaven', 
                                          'Full Beard/Chinstrap' : 'Full_Beard_Chinstrap', 'Goatee': 'Goatee', 'Moustache' : 'Moustache',
                                          'Moustache (with Muttonchops)': 'Moustache_wMuttonchops', 
                                          'Moustache (with Sideburns)': 'Moustache_wSideburns', 'Muttonchops':'Muttonchops', 
                                          'Sideburns':'Sideburns'})
facial_hair.columns

Index(['Year', 'Cleanshaven', 'Full_Beard_Chinstrap', 'Goatee', 'Moustache',
       'Moustache_wMuttonchops', 'Moustache_wSideburns', 'Muttonchops',
       'Sideburns'],
      dtype='object')

In [24]:
facial_hair.to_csv("data/facial_hair.csv", index=False)

## Divorce and Marriage

In [25]:
rates_file = pd.read_csv("resources/national_marriage_divorce_rates_00-16.csv" , encoding="ISO-8859-1")
dm_rates = pd.DataFrame(rates_file)
dm_rates.index.rename('dm_id', inplace=True)
dm_rates.head()

,Year,Marriages,Population,"Rate per 1,000 total population",Divorces & annulments,Population.1,"Rate per 1,000 total population.1"
dm_id,,,,,,,
0,2016,"2,245,404","323,127,513",6.9,"827,261","257,904,548",3.2
1,2015,"2,221,579","321,418,820",6.9,"800,909","258,518,265",3.1
2,2014,"2,140,272","308,759,713",6.9,"813,862","256,483,624",3.2
3,2013,"2,081,301","306,136,672",6.8,"832,157","254,408,815",3.3
4,2012,"2,131,000","313,914,040",6.8,"851,000","248,041,986",3.4

In [27]:
dm_rates = dm_rates.rename(columns={'Year': 'Year', 'Marriages' : 'Marriages', 'Population' : 'Population',
                                    'Rate per 1,000 total population':'Rate_per_1k_TtlPop', 'Divorces & annulments' : 'Divorces',
                                    'Population.1':'Pop', 'Rate per 1,000 total population.1' : 'Rate_per_1kTtlPop'})
dm_rates = dm_rates[['Year', 'Population','Marriages', 'Divorces']]
dm_rates.head()

       Year   Population  Marriages Divorces
dm_id
0      2016  323,127,513  2,245,404  827,261
1      2015  321,418,820  2,221,579  800,909
2      2014  308,759,713  2,140,272  813,862
3      2013  306,136,672  2,081,301  832,157
4      2012  313,914,040  2,131,000  851,000

In [59]:
dm_rates.dtypes

Year           int64
Population    object
Marriages     object
Divorces      object
dtype: object

In [28]:
dm_rates.to_csv("data/dm_rates.csv", index=False)

## Ted Talks

In [29]:
ted_file = pd.read_csv("resources/TED_Talks_by_ID_plus-transcripts-and-LIWC-and-MFT-plus-views.csv" , encoding="ISO-8859-1")
ted = pd.DataFrame(ted_file)
ted.head(3)

,id,speaker,headline,URL,description,transcript_URL,month_filmed,year_filmed,event,duration,...,harm_vice,fairness_virtue,fairness_vice,ingroup_virtue,ingroup_vice,authority_virtue,authority_vice,purity_virtue,purity_vice,morality_general
0,1,Al Gore,Averting the climate crisis,http://www.ted.com/talks/view/id/1,With the same humor and humanity he exuded in ...,http://www.ted.com/talks/view/id/1/transcript?...,2,2006,TED2006,0:16:17,...,0.04,0.00,0.00,0.48,0.00,0.22,0.0,0.00,0.00,0.22
1,2,Amy Smith,Simple designs to save a life,http://www.ted.com/talks/view/id/2,Fumes from indoor cooking fires kill more than...,http://www.ted.com/talks/view/id/2/transcript?...,2,2006,TED2006,0:15:06,...,0.04,0.00,0.00,0.30,0.00,0.11,0.0,0.11,0.04,0.15
2,3,Ashraf Ghani,How to rebuild a broken state,http://www.ted.com/talks/view/id/3,Ashraf Ghani's passionate and powerful 10-minu...,http://www.ted.com/talks/view/id/3/transcript?...,7,2005,TEDGlobal 2005,0:18:45,...,0.12,0.16,0.04,0.32,0.12,0.20,0.0,0.04,0.04,0.08

In [30]:
ted_yr = ted.rename(columns={'year_filmed': 'Year'})
ted_yr.head(2)

,id,speaker,headline,URL,description,transcript_URL,month_filmed,Year,event,duration,...,harm_vice,fairness_virtue,fairness_vice,ingroup_virtue,ingroup_vice,authority_virtue,authority_vice,purity_virtue,purity_vice,morality_general
0,1,Al Gore,Averting the climate crisis,http://www.ted.com/talks/view/id/1,With the same humor and humanity he exuded in ...,http://www.ted.com/talks/view/id/1/transcript?...,2,2006,TED2006,0:16:17,...,0.04,0.0,0.0,0.48,0.0,0.22,0.0,0.00,0.00,0.22
1,2,Amy Smith,Simple designs to save a life,http://www.ted.com/talks/view/id/2,Fumes from indoor cooking fires kill more than...,http://www.ted.com/talks/view/id/2/transcript?...,2,2006,TED2006,0:15:06,...,0.04,0.0,0.0,0.30,0.0,0.11,0.0,0.11,0.04,0.15

In [31]:
ted_yr = ted_yr.rename(columns={'id':'ted_id', 'views_as_of_06162017': 'views'})
ted_yr.columns

Index(['ted_id', 'speaker', 'headline', 'URL', 'description', 'transcript_URL',
       'month_filmed', 'Year', 'event', 'duration',
       ...
       'harm_vice', 'fairness_virtue', 'fairness_vice', 'ingroup_virtue',
       'ingroup_vice', 'authority_virtue', 'authority_vice', 'purity_virtue',
       'purity_vice', 'morality_general'],
      dtype='object', length=123)

In [60]:
ted_up = ted_yr[['ted_id','speaker', 'headline', 'URL','description', 'month_filmed', 'Year', 'event', 'duration', 
                 'date_published', 'views', 'tags']]
ted_up.set_index('ted_id', inplace=True)
ted_up.head(3)

,speaker,headline,URL,description,month_filmed,Year,event,duration,date_published,views,tags
ted_id,,,,,,,,,,,
1,Al Gore,Averting the climate crisis,http://www.ted.com/talks/view/id/1,With the same humor and humanity he exuded in ...,2,2006,TED2006,0:16:17,6/27/06,3177001.0,"cars,alternative energy,culture,politics,scien..."
2,Amy Smith,Simple designs to save a life,http://www.ted.com/talks/view/id/2,Fumes from indoor cooking fires kill more than...,2,2006,TED2006,0:15:06,8/15/06,1379328.0,"MacArthur grant,simplicity,industrial design,a..."
3,Ashraf Ghani,How to rebuild a broken state,http://www.ted.com/talks/view/id/3,Ashraf Ghani's passionate and powerful 10-minu...,7,2005,TEDGlobal 2005,0:18:45,10/18/06,790536.0,"corruption,poverty,economics,investment,milita..."

In [34]:
ted_up.to_csv("data/ted_up.csv", index=False)

# World Population

## World Population website scrape

In [35]:
url = 'http://www.worldometers.info/world-population/world-population-projections/'

In [36]:
worldpop_future = pd.read_html(url)
type(worldpop_future)

list

In [61]:
pop_df = worldpop_future[0]
# pop_df
pop_df = pop_df[['Year', 'World Population']]
pop_df.head()
pop_df.dtypes

Year                int64
World Population    int64
dtype: object

In [38]:
# read in world population excel
worldpop = pd.read_excel("resources/WPP2017.xlsx", index_col=None, header=0)
worldpop.to_csv('resources/world_pop.csv', index=False)
worldpop = pd.read_csv('resources/world_pop.csv', index_col=None, header=0)
worldpop = pd.DataFrame(worldpop)
worldpop.drop([0, 1, 2, 3, 4, 5 ,6 ,7 , 8, 9 , 10, 11, 12, 13], inplace=True)
pop_trans = worldpop.transpose()
pop_trans.drop(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 2'], inplace=True)
# pop_trans
population = pop_trans[[14,15]]
# population
population = population.rename(columns={14 : 'Year', 15 : 'World Population'})
population
population.columns

Index(['Year', 'World Population'], dtype='object')

In [82]:
ttl_pop = pd.concat([population , pop_df], ignore_index=True)
# ttl_pop.set_index('Year', inplace=True)
ttl_pop.head()
ttl_pop.dtypes

Year                object
World Population    object
dtype: object

In [84]:
# df[list("ABCD")] = df[list("ABCD")].astype(int)
ttl_pop['Year'] = ttl_pop['Year'].astype(int)
type(ttl_pop.index)
ttl_pop.set_index('Year', inplace=True)
ttl_pop.head()

     World Population
Year
1950      2536274.721
1951      2.58382e+06
1952      2.63058e+06
1953      2.67723e+06
1954       2.7243e+06

In [85]:
ttl_pop.dtypes

World Population    object
dtype: object

In [93]:
ttl_pop = ttl_pop.rename(columns={'World Population': 'world_population'})
ttl_pop.head(2)

     world_population
Year
1950      2536274.721
1951      2.58382e+06

In [87]:
ttl_pop.to_csv("data/complete_worldpop.csv", index=False)

In [88]:
ttl_pop_df = pd.DataFrame(ttl_pop)
ttl_pop_df.head()

     world_population
Year
1950      2536274.721
1951      2.58382e+06
1952      2.63058e+06
1953      2.67723e+06
1954       2.7243e+06

### merged tables

In [92]:
# world population and divorces/marriages on dm
dm_world = pd.merge(dm_rates, ttl_pop_df, on="Year", how="left")
dm_world.head()

   Year   Population  Marriages Divorces world_population
0  2016  323,127,513  2,245,404  827,261              NaN
1  2015  321,418,820  2,221,579  800,909      7.38301e+06
2  2014  308,759,713  2,140,272  813,862      7.29845e+06
3  2013  306,136,672  2,081,301  832,157      7.21343e+06
4  2012  313,914,040  2,131,000  851,000      7.12818e+06

In [103]:
# dm_world and facial hair merge
dm_world_hair = pd.merge(facial_hair, dm_world, on="Year", how="left")
dm_world_hair.fillna(0, inplace=True)
world_dm_hair = pd.merge(ttl_pop, dm_world_hair, on="Year", how="left")
world_dm_hair.fillna(0, inplace=True)
# world_dm_hair.drop([world_population_y], inplace=True)
world_dm_hair

,Year,world_population_x,Cleanshaven,Full_Beard_Chinstrap,Goatee,Moustache,Moustache_wMuttonchops,Moustache_wSideburns,Muttonchops,Sideburns,Population,Marriages,Divorces,world_population_y
0,1950,2536274.721,1380.0,3.0,0.0,116.0,0.0,1.0,0.0,1.0,0,0,0,0.0
1,1951,2.58382e+06,1111.0,0.0,0.0,83.0,0.0,0.0,0.0,0.0,0,0,0,0.0
2,1952,2.63058e+06,987.0,1.0,0.0,52.0,0.0,0.0,0.0,2.0,0,0,0,0.0
3,1953,2.67723e+06,889.0,0.0,0.0,44.0,0.0,0.0,0.0,0.0,0,0,0,0.0
4,1954,2.7243e+06,833.0,1.0,1.0,32.0,0.0,0.0,0.0,0.0,0,0,0,0.0
5,1955,2.77224e+06,801.0,1.0,0.0,33.0,0.0,0.0,0.0,1.0,0,0,0,0.0
6,1956,2.82138e+06,931.0,0.0,0.0,21.0,0.0,0.0,0.0,1.0,0,0,0,0.0
7,1957,2.87195e+06,962.0,0.0,0.0,16.0,0.0,0.0,0.0,2.0,0,0,0,0.0
8,1958,2.92408e+06,1024.0,3.0,0.0,17.0,0.0,0.0,0.0,0.0,0,0,0,0.0
9,1959,2.97782e+06,947.0,7.0,1.0,10.0,0.0,0.0,0.0,1.0,0,0,0,0.0
10,1960,3.03321e+06,924.0,7.0,1.0,13.0,0.0,0.0,0.0,1.0,0,0,0,0.0
11,1961,3.09031e+06,912.0,2.0,1.0,5.0,0.0,0.0,0.0,1.0,0,0,0,0.0
12,1962,3.14924e+06,971.0,0.0,1.0,17.0,0.0,0.0,0.0,2.0,0,0,0,0.0
13,1963,3.21027e+06,965.0,2.0,0.0,4.0,0.0,0.0,0.0,0.0,0,0,0,0.0
14,1964,3.27367e+06,1062.0,7.0,1.0,10.0,0.0,0.0,0.0,2.0,0,0,0,0.0
15,1965,3.33959e+06,1279.0,6.0,2.0,7.0,0.0,0.0,0.0,1.0,0,0,0,0.0
16,1966,3.40812e+06,1243.0,5.0,2.0,20.0,0.0,0.0,0.0,2.0,0,0,0,0.0
17,1967,3.47905e+06,1284.0,17.0,8.0,5.0,0.0,0.0,1.0,22.0,0,0,0,0.0
18,1968,3.55188e+06,1105.0,24.0,6.0,9.0,2.0,3.0,8.0,92.0,0,0,0,0.0
19,1969,3.62591e+06,849.0,29.0,10.0,17.0,11.0,22.0,90.0,415.0,0,0,0,0.0
20,1970,3.70058e+06,432.0,52.0,23.0,12.0,41.0,24.0,302.0,472.0,0,0,0,0.0
21,1971,3.77579e+06,247.0,68.0,25.0,15.0,97.0,27.0,458.0,383.0,0,0,0,0.0
22,1972,3.85155e+06,215.0,120.0,35.0,40.0,171.0,67.0,453.0,289.0,0,0,0,0.0
23,1973,3.92754e+06,99.0,100.0,14.0,27.0,181.0,69.0,453.0,208.0,0,0,0,0.0
24,1974,4.00345e+06,161.0,166.0,18.0,56.0,204.0,107.0,420.0,303.0,0,0,0,0.0
25,1975,4.07909e+06,218.0,153.0,14.0,98.0,129.0,127.0,254.0,318.0,0,0,0,0.0
26,1976,4.15429e+06,168.0,119.0,8.0,56.0,59.0,73.0,71.0,163.0,0,0,0,0.0
27,1977,4.2292e+06,237.0,111.0,7.0,96.0,41.0,95.0,59.0,168.0,0,0,0,0.0
28,1978,4.30438e+06,273.0,161.0,4.0,100.0,42.0,85.0,54.0,158.0,0,0,0,0.0
29,1979,4.38059e+06,267.0,120.0,3.0,86.0,34.0,71.0,38.0,135.0,0,0,0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119,2071,10606640450,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
120,2072,10636651714,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
121,2073,10665879012,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
122,2074,10694316774,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
123,2075,10721963763,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
124,2076,10748825986,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
125,2077,10774916274,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
126,2078,10800248725,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
127,2079,10824840805,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
128,2080,10848708184,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
129,2081,10871858040,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
130,2082,10894298619,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
131,2083,10916049655,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
132,2084,10937133165,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
133,2085,10957565804,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
134,2086,10977355755,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
135,2087,10996502489,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
136,2088,11015004824,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
137,2089,11032857615,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
138,2090,11050055193,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
139,2091,11066592635,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
140,2092,11082465223,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
141,2093,11097667992,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
142,2094,11112193711,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
143,2095,11126032796,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
144,2096,11139172514,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
145,2097,11151596850,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
146,2098,11163286403,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
147,2099,11174218742,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0
148,2100,11184367721,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0

In [104]:
world_dm_hair.to_csv('data/world_dm_hair.csv', index=False)

## load all datasets into mySQL

In [60]:
 # Dependencies
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()
from sqlalchemy import Column, Integer, String, Float

from config import dbuser, dbpasswd, dburi, dbport, dbname

In [61]:
engine = create_engine((f"mysql://root:{dbpasswd}@localhost/jeopardy"), pool_pre_ping=True)
print(engine)

Engine(mysql://root:***@localhost/jeopardy)

In [63]:
engine.table_names()

['complete_jeopardy', 'complete_worldpop', 'dm_rates', 'facial_hair', 'ted_up']

Load df to db

In [91]:
complete_jeopardy.to_sql(name='complete_jeopardy', con=engine, if_exists='append', index=True)

In [66]:
facial_hair.to_sql(name='facial_hair', con=engine, if_exists='append', index=True)

In [71]:
dm_rates.to_sql(name='dm_rates', con=engine, if_exists='append', index=True)

In [92]:
ted_up.to_sql(name='ted_up', con=engine, if_exists='append', index=True)

In [94]:
ttl_pop.to_sql(name='complete_worldpop', con=engine, if_exists='append', index=True)